MetalheadKen/C-Programming-Language/STM32F4_Project/STM32_WWDG/Utilities/STM32_EVAL/STM32F4_EVB/stm32f4_evb_i2c_ee.c
/**
  ******************************************************************************
  * @file    stm32f4_evb_i2c_ee.c
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    21-March-2013
  * @brief   This file provides a set of functions needed to manage the I2C M24CXX
  *          EEPROM memory mounted on STM32F4-EVB evaluation board.
  *
  *          ===================================================================
  *          Note: This driver is intended for STM32F4xx families devices only.
  *          ===================================================================
  *
  *          It implements a high level communication layer for read and write
  *          from/to this memory. The needed STM32 hardware resources (I2C and
  *          GPIO) are defined in stm32f4_evb.h file, and the initialization is
  *          performed in sEE_LowLevel_Init() function declared in stm32f4_evb.c
  *          file.
  *          You can easily tailor this driver to any other development board,
  *          by just adapting the defines for hardware resources and
  *          sEE_LowLevel_Init() function.
  *
  *          @note In this driver, basic read and write functions (sEE_ReadBuffer()
  *                and sEE_WritePage()) use the DMA to perform the data transfer
  *                to/from EEPROM memory (except when number of requested data is
  *                equal to 1). Thus, after calling these two functions, user
  *                application may perform other tasks while DMA is transferring
  *                data. The application should then monitor the variable holding
  *                the number of data in order to determine when the transfer is
  *                completed (variable decremented to 0). Stopping transfer tasks
  *                are performed into DMA interrupt handlers (which are integrated
  *                into this driver).
  *
  *     +-----------------------------------------------------------------+
  *     |                        Pin assignment                           |
  *     +---------------------------------------+-----------+-------------+
  *     |  STM32 I2C Pins                       |   sEE     |   Pin       |
  *     +---------------------------------------+-----------+-------------+
  *     | .                                     |   E0(GND) |    1  (0V)  |
  *     | .                                     |   E1(GND) |    2  (0V)  |
  *     | .                                     |   E2(GND) |    3  (0V)  |
  *     | .                                     |   E0(VSS) |    4  (0V)  |
  *     | sEE_I2C_SDA_PIN/ SDA                  |   SDA     |    5        |
  *     | sEE_I2C_SCL_PIN/ SCL                  |   SCL     |    6        |
  *     | .                                     |   /WC(VDD)|    7 (3.3V) |
  *     | .                                     |   VDD     |    8 (3.3V) |
  *     +---------------------------------------+-----------+-------------+
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4_evb_i2c_ee.h"

/** @addtogroup Utilities
  * @{
  */

/** @addtogroup STM32F4_EVB
  * @{
  */

/** @addtogroup STM32F4_EVB
  * @{
  */

/** @addtogroup STM32F4_EVB_I2C_EE
  * @brief      This file includes the I2C EEPROM driver of STM32-EVAL boards.
  * @{
  */

/** @defgroup STM32F4_EVB_I2C_EE_Private_Types
  * @{
  */
/**
  * @}
  */


/** @defgroup STM32F4_EVB_I2C_EE_Private_Defines
  * @{
  */
/**
  * @}
  */


/** @defgroup STM32F4_EVB_I2C_EE_Private_Macros
  * @{
  */
/**
  * @}
  */


/** @defgroup STM32F4_EVB_I2C_EE_Private_Variables
  * @{
  */
__IO uint16_t  sEEAddress = 0;
__IO uint32_t  sEETimeout = sEE_LONG_TIMEOUT;
__IO uint16_t* sEEDataReadPointer;
__IO uint8_t*  sEEDataWritePointer;
__IO uint8_t   sEEDataNum;
/**
  * @}
  */


/** @defgroup STM32F4_EVB_I2C_EE_Private_Function_Prototypes
  * @{
  */
/**
  * @}
  */


/** @defgroup STM32F4_EVB_I2C_EE_Private_Functions
  * @{
  */

/**
  * @brief  DeInitializes peripherals used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
void sEE_DeInit(void)
{
    sEE_LowLevel_DeInit();
}

/**
  * @brief  Initializes peripherals used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
void sEE_Init(void)
{
    I2C_InitTypeDef  I2C_InitStructure;

    sEE_LowLevel_Init();

    /*!< I2C configuration */
    /* sEE_I2C configuration */
    I2C_InitStructure.I2C_Mode					= I2C_Mode_I2C;
    I2C_InitStructure.I2C_DutyCycle				= I2C_DutyCycle_2;
    I2C_InitStructure.I2C_OwnAddress1			= I2C_SLAVE_ADDRESS7;
    I2C_InitStructure.I2C_Ack					= I2C_Ack_Enable;
    I2C_InitStructure.I2C_AcknowledgedAddress	= I2C_AcknowledgedAddress_7bit;
    I2C_InitStructure.I2C_ClockSpeed			= I2C_SPEED;

    /* sEE_I2C Peripheral Enable */
    I2C_Cmd(sEE_I2C, ENABLE);
    /* Apply sEE_I2C configuration after enabling it */
    I2C_Init(sEE_I2C, &I2C_InitStructure);

#if defined (sEE_M24C64_32)
    /*!< Select the EEPROM address according to the state of E0, E1, E2 pins */
    sEEAddress = sEE_HW_ADDRESS;
#elif defined (sEE_M24C08)
    /*!< depending on the sEE Address selected in the stm32f4_evb_i2c_ee.h file */
#ifdef sEE_Block0_ADDRESS
    /*!< Select the sEE Block0 to write on */
    sEEAddress = sEE_Block0_ADDRESS;
#endif

#ifdef sEE_Block1_ADDRESS
    /*!< Select the sEE Block1 to write on */
    sEEAddress = sEE_Block1_ADDRESS;
#endif

