MetalheadKen/C-Programming-Language/STM32F4_Project/STM32_WWDG/Utilities/STM32_EVAL/STM32F4_EVB/stm32f4_evb_i2c_ee.c
    /*!< While the bus is busy */
    sEETimeout = sEE_LONG_TIMEOUT;
    while (I2C_GetFlagStatus(sEE_I2C, I2C_FLAG_BUSY)) {
        if ((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
    }

    /*!< Send START condition */
    I2C_GenerateSTART(sEE_I2C, ENABLE);

    /*!< Test on EV5 and clear it */
    sEETimeout = sEE_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_MODE_SELECT)) {
        if ((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
    }

    /*!< Send EEPROM address for write */
    sEETimeout = sEE_FLAG_TIMEOUT;
    I2C_Send7bitAddress(sEE_I2C, sEEAddress, I2C_Direction_Transmitter);

    /*!< Test on EV6 and clear it */
    sEETimeout = sEE_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED)) {
        if ((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
    }

#ifdef sEE_M24C08
    /*!< Send the EEPROM's internal address to write to : only one byte Address */
    I2C_SendData(sEE_I2C, WriteAddr);
#elif defined(sEE_M24C64_32)
    /*!< Send the EEPROM's internal address to write to : MSB of the address first */
    I2C_SendData(sEE_I2C, (uint8_t)((WriteAddr & 0xFF00) >> 8));
    /*!< Test on EV8 and clear it */
    sEETimeout = sEE_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTING)) {
        if ((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
    }
    /*!< Send the EEPROM's internal address to write to : LSB of the address */
    I2C_SendData(sEE_I2C, (uint8_t)(WriteAddr & 0x00FF));
#endif /*!< sEE_M24C08 */

    /*!< Test on EV8 and clear it */
    sEETimeout = sEE_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTING)) {
        if ((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
    }
    for (i = 0; i < *sEEDataWritePointer; i++) {
        I2C_SendData(sEE_I2C, pBuffer[i]);
        sEETimeout = sEE_FLAG_TIMEOUT;
        while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTING)) {
            if ((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
        }
    }
    I2C_AcknowledgeConfig(sEE_I2C, DISABLE);
    I2C_GenerateSTOP(sEE_I2C, ENABLE);

    /* If all operations OK, return sEE_OK (0) */
    return sEE_OK;
}

/**
  * @brief  Writes buffer of data to the I2C EEPROM.
  * @param  pBuffer : pointer to the buffer  containing the data to be written
  *         to the EEPROM.
  * @param  WriteAddr : EEPROM's internal address to write to.
  * @param  NumByteToWrite : number of bytes to write to the EEPROM.
  * @retval None
  */
void sEE_WriteBuffer(uint8_t* pBuffer, uint16_t WriteAddr, uint16_t NumByteToWrite)
{
    uint8_t NumOfPage = 0, NumOfSingle = 0, count = 0;
    uint16_t Addr = 0;

    Addr = WriteAddr % sEE_PAGESIZE;
    count = sEE_PAGESIZE - Addr;
    NumOfPage =  NumByteToWrite / sEE_PAGESIZE;
    NumOfSingle = NumByteToWrite % sEE_PAGESIZE;

    /*!< If WriteAddr is sEE_PAGESIZE aligned  */
    if (Addr == 0) {
        /*!< If NumByteToWrite < sEE_PAGESIZE */
        if (NumOfPage == 0) {
            /* Store the number of data to be written */
            sEEDataNum = NumOfSingle;
            /* Start writing data */
            sEE_WritePage(pBuffer, WriteAddr, (uint8_t*)(&sEEDataNum));
            /* Wait transfer through DMA to be complete */
            sEETimeout = sEE_LONG_TIMEOUT;
            while (sEEDataNum > 0) {
                if ((sEETimeout--) == 0) {
                    sEE_TIMEOUT_UserCallback();
                    return;
                }
            }
            sEE_WaitEepromStandbyState();
        }
        /*!< If NumByteToWrite > sEE_PAGESIZE */
        else {
            while (NumOfPage--) {
                /* Store the number of data to be written */
                sEEDataNum = sEE_PAGESIZE;
                sEE_WritePage(pBuffer, WriteAddr, (uint8_t*)(&sEEDataNum));
                /* Wait transfer through DMA to be complete */
                /*sEETimeout = sEE_LONG_TIMEOUT;
                while (sEEDataNum > 0)
                {
                	if ((sEETimeout--) == 0)
                	{
                		sEE_TIMEOUT_UserCallback();
                		return;
                	}
                }*/
                sEE_WaitEepromStandbyState();
                WriteAddr += sEE_PAGESIZE;
                pBuffer += sEE_PAGESIZE;
            }

            if (NumOfSingle != 0) {
                /* Store the number of data to be written */
                sEEDataNum = NumOfSingle;
                sEE_WritePage(pBuffer, WriteAddr, (uint8_t*)(&sEEDataNum));
                /* Wait transfer through DMA to be complete */
                sEETimeout = sEE_LONG_TIMEOUT;
                while (sEEDataNum > 0) {
                    if ((sEETimeout--) == 0) {
                        sEE_TIMEOUT_UserCallback();
                        return;
                    }
                }
                sEE_WaitEepromStandbyState();
            }
        }
    }
    /*!< If WriteAddr is not sEE_PAGESIZE aligned  */
    else {
        /*!< If NumByteToWrite < sEE_PAGESIZE */
        if (NumOfPage== 0) {
            /*!< If the number of data to be written is more than the remaining space
            in the current page: */
            if (NumByteToWrite > count) {
                /* Store the number of data to be written */
                sEEDataNum = count;
                /*!< Write the data contained in same page */
                sEE_WritePage(pBuffer, WriteAddr, (uint8_t*)(&sEEDataNum));
                /* Wait transfer through DMA to be complete */
                sEETimeout = sEE_LONG_TIMEOUT;
                while (sEEDataNum > 0) {
                    if ((sEETimeout--) == 0) {
                        sEE_TIMEOUT_UserCallback();
                        return;
                    };
                }
                sEE_WaitEepromStandbyState();

                /* Store the number of data to be written */
                sEEDataNum = (NumByteToWrite - count);
                /*!< Write the remaining data in the following page */
                sEE_WritePage((uint8_t*)(pBuffer + count), (WriteAddr + count), (uint8_t*)(&sEEDataNum));
                /* Wait transfer through DMA to be complete */
                sEETimeout = sEE_LONG_TIMEOUT;
                while (sEEDataNum > 0) {
                    if ((sEETimeout--) == 0) {
                        sEE_TIMEOUT_UserCallback();
                        return;
                    };
                }
                sEE_WaitEepromStandbyState();
            } else {
                /* Store the number of data to be written */
                sEEDataNum = NumOfSingle;
                sEE_WritePage(pBuffer, WriteAddr, (uint8_t*)(&sEEDataNum));
                /* Wait transfer through DMA to be complete */
                sEETimeout = sEE_LONG_TIMEOUT;
                while (sEEDataNum > 0) {
                    if ((sEETimeout--) == 0) {
                        sEE_TIMEOUT_UserCallback();
                        return;
                    };
                }
                sEE_WaitEepromStandbyState();
            }
        }
        /*!< If NumByteToWrite > sEE_PAGESIZE */
        else {
            NumByteToWrite -= count;
            NumOfPage =  NumByteToWrite / sEE_PAGESIZE;
            NumOfSingle = NumByteToWrite % sEE_PAGESIZE;

            if (count != 0) {
                /* Store the number of data to be written */
                sEEDataNum = count;
                sEE_WritePage(pBuffer, WriteAddr, (uint8_t*)(&sEEDataNum));
                /* Wait transfer through DMA to be complete */
                sEETimeout = sEE_LONG_TIMEOUT;
                while (sEEDataNum > 0) {
                    if ((sEETimeout--) == 0) {
                        sEE_TIMEOUT_UserCallback();
                        return;
                    };
                }
                sEE_WaitEepromStandbyState();
                WriteAddr += count;
                pBuffer += count;
            }

