MetalheadKen/C-Programming-Language/STM32F4_Project/STM32_WWDG/Utilities/STM32_EVAL/STM32F4_EVB/stm32f4_evb_i2c_ee.c
            while (NumOfPage--) {
                /* Store the number of data to be written */
                sEEDataNum = sEE_PAGESIZE;
                sEE_WritePage(pBuffer, WriteAddr, (uint8_t*)(&sEEDataNum));
                /* Wait transfer through DMA to be complete */
                sEETimeout = sEE_LONG_TIMEOUT;
                while (sEEDataNum > 0) {
                    if ((sEETimeout--) == 0) {
                        sEE_TIMEOUT_UserCallback();
                        return;
                    };
                }
                sEE_WaitEepromStandbyState();
                WriteAddr +=  sEE_PAGESIZE;
                pBuffer += sEE_PAGESIZE;
            }
            if (NumOfSingle != 0) {
                /* Store the number of data to be written */
                sEEDataNum = NumOfSingle;
                sEE_WritePage(pBuffer, WriteAddr, (uint8_t*)(&sEEDataNum));
                /* Wait transfer through DMA to be complete */
                sEETimeout = sEE_LONG_TIMEOUT;
                while (sEEDataNum > 0) {
                    if ((sEETimeout--) == 0) {
                        sEE_TIMEOUT_UserCallback();
                        return;
                    };
                }
                sEE_WaitEepromStandbyState();
            }
        }
    }
}

/**
  * @brief  Wait for EEPROM Standby state.
  *
  * @note  This function allows to wait and check that EEPROM has finished the
  *        last operation. It is mostly used after Write operation: after receiving
  *        the buffer to be written, the EEPROM may need additional time to actually
  *        perform the write operation. During this time, it doesn't answer to
  *        I2C packets addressed to it. Once the write operation is complete
  *        the EEPROM responds to its address.
  *
  * @param  None
  * @retval sEE_OK (0) if operation is correctly performed, else return value
  *         different from sEE_OK (0) or the timeout user callback.
  */
uint32_t sEE_WaitEepromStandbyState(void)
{
    __IO uint16_t tmpSR1 = 0;
    __IO uint32_t sEETrials = 0;

    /*!< While the bus is busy */
    sEETimeout = sEE_LONG_TIMEOUT;
    while (I2C_GetFlagStatus(sEE_I2C, I2C_FLAG_BUSY)) {
        if ((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
    }

    /* Keep looping till the slave acknowledge his address or maximum number
    	of trials is reached (this number is defined by sEE_MAX_TRIALS_NUMBER define
    	in stm32f4_evb_i2c_ee.h file) */
    while (1) {
        /*!< Send START condition */
        I2C_GenerateSTART(sEE_I2C, ENABLE);

        /*!< Test on EV5 and clear it */
        sEETimeout = sEE_FLAG_TIMEOUT;
        while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_MODE_SELECT)) {
            if ((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
        }

        /*!< Send EEPROM address for write */
        I2C_Send7bitAddress(sEE_I2C, sEEAddress, I2C_Direction_Transmitter);

        /* Wait for ADDR flag to be set (Slave acknowledged his address) */
        sEETimeout = sEE_LONG_TIMEOUT;
        do {
            /* Get the current value of the SR1 register */
            tmpSR1 = sEE_I2C->SR1;

            /* Update the timeout value and exit if it reach 0 */
            if ((sEETimeout--) == 0) return sEE_TIMEOUT_UserCallback();
        }
        /* Keep looping till the Address is acknowledged or the AF flag is
        set (address not acknowledged at time) */
        while((tmpSR1 & (I2C_SR1_ADDR | I2C_SR1_AF)) == 0);

        /* Check if the ADDR flag has been set */
        if (tmpSR1 & I2C_SR1_ADDR) {
            /* Clear ADDR Flag by reading SR1 then SR2 registers (SR1 have already
            	been read) */
            (void)sEE_I2C->SR2;

            /*!< STOP condition */
            I2C_GenerateSTOP(sEE_I2C, ENABLE);

            /* Exit the function */
            return sEE_OK;
        } else {
            /*!< Clear AF flag */
            I2C_ClearFlag(sEE_I2C, I2C_FLAG_AF);
        }

        /* Check if the maximum allowed number of trials has bee reached */
        if (sEETrials++ == sEE_MAX_TRIALS_NUMBER) {
            /* If the maximum number of trials has been reached, exit the function */
            return sEE_TIMEOUT_UserCallback();
        }
    }
}

#ifdef USE_DEFAULT_TIMEOUT_CALLBACK
/**
  * @brief  Basic management of the timeout situation.
  * @param  None.
  * @retval None.
  */
uint32_t sEE_TIMEOUT_UserCallback(void)
{
    /* Block communication and all processes */
    while (1) {
    }
}
#endif /* USE_DEFAULT_TIMEOUT_CALLBACK */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
